---
kind: property
id: P:Autodesk.Revit.UI.TextEditorOptions.ShowOpaqueBackground
source: html/5f661bc3-cf47-33cc-0b44-dca307436d2e.htm
---
# Autodesk.Revit.UI.TextEditorOptions.ShowOpaqueBackground Property

Show opaque background behind the text during editing.

## Syntax (C#)
```csharp
public bool ShowOpaqueBackground { get; set; }
```

## Remarks
If false, the background will be opaque or not depending on the edited text note's type Background setting.
 If true, the background behind the text will always be opaque during editing.